app/controllers/cart_controller.rb

SELECT * FROM `products` WHERE (`products`.`id` = 1)
---
  def remove_from_cart
    product = Product.find(params[:product_id])