app/controllers/catalog_controller.rb

SELECT * FROM `products` WHERE (`products`.`id` = 3)
---
  def add_to_cart
    if request.xhr? then
      product = Product.find(params[:product_id])