app/controllers/categories_controller.rb

  def edit
    @category = Category.find(params[:id])
---
SELECT * FROM `categories` WHERE (`categories`.`id` = 1)

  def create
    @category = Category.new(params[:category])

    respond_to do |format|
      if @category.save
---
INSERT INTO `categories` (`image_file_name`, `created_at`, `title`, `image_file_size`, `updated_at`, `image_content_type`, `description`, `image_updated_at`) VALUES(NULL, '2009-11-14 17:22:06', 'Test', NULL, '2009-11-14 17:22:06', NULL, 'Test', NULL)

  def update
    @category = Category.find(params[:id])

    respond_to do |format|
      if @category.update_attributes(params[:category])
---
SELECT * FROM `categories` WHERE (`categories`.`id` = 1)
UPDATE `categories` SET `updated_at` = '2009-11-14 17:28:47', `image_file_size` = 342170, `image_file_name` = 'FirefoxSchnappschuss002.png', `image_updated_at` = '2009-11-14 17:28:46', `image_content_type` = 'image/png' WHERE `id` = 1