app/controllers/frontend_controller.rb

SELECT * FROM `categories` ORDER BY title
---
  def load_categories
    @categories = Category.all(:order => :title)