app/controllers/frontend_controller.rb

SELECT * FROM `products` WHERE (`products`.`id` = 1)
---
  def add_to_cart
    if request.xhr? then
      product = Product.find(params[:product_id])