app/controllers/products_controller.rb

INSERT INTO `products` (`price`, `image_file_name`, `created_at`, `title`, `image_file_size`, `updated_at`, `image_content_type`, `category_id`, `description`, `image_updated_at`) VALUES(4.5, 'julian_fischer.jpg', '2009-11-14 17:54:14', 'Testauspuff', 6322, '2009-11-14 17:54:14', 'image/jpeg', NULL, 'Heeloooooooooo', '2009-11-14 17:54:14')
---
  def create
    @product = Product.new(params[:product])

    respond_to do |format|
      if @product.save

SELECT * FROM `products` WHERE (`products`.`id` = 1)
UPDATE `products` SET `updated_at` = '2009-11-14 18:03:38', `category_id` = 1 WHERE `id` = 1
---
  def update
    @product = Product.find(params[:id])

    respond_to do |format|
      if @product.update_attributes(params[:product])